homework/Lab07/combustorReaction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         reactingFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             0.1;

deltaT              5e-07;

writeControl        adjustableRunTime;

writeInterval       5e-04;

purgeWrite          0;

writeFormat         ascii;

writePrecision      6;

writeCompression    off;

timeFormat          general;

timePrecision       6;

runTimeModifiable   true;

adjustTimeStep      yes;

maxCo               0.3;

functions
{
    residuals
    {
      type      residuals;
      enabled   yes;
      fields    (p U k epsilon h CH4 CO2 H2O O2 H2);
      libs      ("libutilityFunctionObjects.so");
    }
}

// ************************************************************************* //
