homework/Lab07/combustorReaction/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
0.767
0.767
0.767
0.767
0.767
0.767
0.767
0.767
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.767;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           nonuniform List<scalar> 
121
(
0.744138
0.745756
0.747017
0.748075
0.748954
0.749661
0.750175
0.750428
...
)
;
    }
    splitter
    {
        type            zeroGradient;
    }
    fuel_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    back
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
