homework/Lab07/combustorReaction/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
31053
(
2.53796e-06
2.1777e-06
3.48795e-06
4.46246e-06
3.74037e-06
5.95991e-06
3.69889e-06
7.17182e-06
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-4.7107e-06
-5.40675e-06
-6.20579e-06
-7.12284e-06
-8.17543e-06
-9.38357e-06
-1.07702e-05
-1.23618e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
121
(
1.79345e-06
3.29906e-06
4.45779e-06
5.65565e-06
6.99596e-06
8.55565e-06
1.04164e-05
1.26794e-05
...
)
;
    }
    splitter
    {
        type            calculated;
        value           uniform 0;
    }
    fuel_inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-2.51423e-05
-2.51386e-05
-2.51387e-05
-2.51382e-05
-2.51379e-05
-2.51374e-05
-2.51369e-05
-2.51357e-05
-2.51345e-05
-2.51222e-05
-2.51215e-05
-2.51339e-05
-2.51352e-05
-2.51365e-05
-2.51373e-05
-2.51379e-05
-2.51385e-05
-2.51392e-05
-2.51394e-05
-2.51432e-05
)
;
    }
    back
    {
        type            calculated;
        value           uniform 0;
    }
    sides
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}

// ************************************************************************* //
