homework/Lab07/combustorReaction/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
        tolerance       1e-06;
        relTol          0.0;
    }
    
    p
    {
        solver      GAMG;
        smoother    GaussSeidel;
        tolerance   1e-06;
        relTol      0.1;
    }

    pFinal
    {
        $p;
        relTol 0.0;
    }    
    
    "(U|k|epsilon|h)"
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-05;
        relTol      0.1;
    }
 
   "(U|k|epsilon|h)Final"
    {
        $U;
        relTol  0.0;
    }

    "(Yi|O2|N2|H2O).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors                 3;
    nOuterCorrectors            500;
    nNonOrthogonalCorrectors    0;
    turbOnFinalInterOnly        false;
    consistent                  yes;

    outerCorrectorResidualControl
    {
        p 
        {
            tolerance   1e-04;
            relTol      0.0;
        }

        U 
        {
            tolerance   1e-05;
            relTol      0.0;
        }

    }
}

relaxationFactors
{
    fields
    {
        "p.*"    0.3;
        "rho.*"  0.5;
    }
 
    equations
    {
        "U.*"         0.5;
        "(k|epsilon)" 0.5;
        h             0.5;
    }
}

// ************************************************************************* //
